In [ ]:
============== Packages for EDA ================
1) Pandaas : Data frame applications


2) Numpy : Numerical python All math applications

3) Matplotlib : used for plotting

4) Seaborn : used for plotting

5) Plotly : used for plotting

6) Bokhe : used for plotting

================== Packages for Machine Learning =================
7) Sickit-learn : sklearn

================ Deep Learning ==================
8) Tensorflow : (developed by) Google

9) Keras : Google

10) Pytorch : Facebook

==================== NLP ===============
11) NLTK : Natural Language Tool Kit

12) Scipy

==================== BERT ===============
13) Transformers : developed by "Hugging face" (Handovered by Google)

==================== Google Models ===============
14) Specific Google Packages

==================== Azure ML ==============
15) Azure Packages

==================== GenAI =================
16) Gemini AI : Google

17) ChatGPT : OpenAI

================= LangChain ================
18) LangChain Packages

## Create a data frame usig List ##

In [ ]:
- list == dictionary

- dictionary == list

$Step-1$:

**Create a empty data frame**

In [1]:
import pandas as pd # package for data frame
names=['Ayush', 'Avinash', 'Akash']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [2]:
names=['Ayush', 'Avinash', 'Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [4]:
age=[20, 24, 26]
pd.DataFrame(age)

    0
0  20
1  24
2  26

In [6]:
names=['Ayush', 'Avinash', 'Akash']
age=[20, 24, 26]
pd.DataFrame(names,age)

          0
20    Ayush
24  Avinash
26    Akash

In [7]:
names=['Ayush', 'Avinash', 'Akash']
age=[20, 24, 26]
pd.DataFrame(zip(names,age))

         0   1
0    Ayush  20
1  Avinash  24
2    Akash  26

In [ ]:
################################

In [9]:
names=['Ayush', 'Avinash', 'Akash']
age=[25, 30, 35]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)

$Step-6$:

**Change the Index**

In [10]:
df

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [12]:
import pandas as pd
names=['Ayush', 'Avinash', 'Akash']
age=[25, 30, 35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
idx=['A','B','C']
cols=['Names','Age','City']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai

In [14]:
import pandas as pd
names=['Ayush', 'Avinash', 'Akash', 'Anvi']
age=[25, 30, 35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
idx=['A','B','C','D']
cols=['Names','Age','City']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

$Step-7$:

**Shape**

- Number of rows

- Number of columns

In [18]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("The number of rows are:", df.shape[0])
print("The number of columns are:", df.shape[1])

The number of rows are: 4
The number of columns are: 3

$Step-8$:

**Drop the column**

- In order to drop column we require 3 parameters

- Column name

    - The column name we need to mention

- axis
    
    - axis=0 **represents rows**
 
    - axis=1 **represents columns**
 
- inplace

    - we are drop column means we are modifying the data frame
 
    - so this modifications we want to save in same variable or different variable
 
    - If you want to keep in the same variable the **inplace=True**

In [19]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [21]:
df.drop('City',axis=1,inplace=True)

In [22]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [25]:
df.drop('Age',axis=1)  # do not give inplace=True

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [26]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [27]:
df1=df.drop('Age',axis=1)

In [28]:
df1

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [29]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [31]:
names=['Ayush', 'Avinash', 'Akash', 'Anvi']
age=[25, 30, 35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
idx=['A','B','C','D']
cols=['Names','Age','City']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [32]:
df.drop('City',axis=1,inplace=True)

In [33]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [34]:
import pandas as pd
names=['Ayush', 'Avinash', 'Akash', 'Anvi']
age=[25, 30, 35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
idx=['A','B','C','D']
cols=['Names','Age','City']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

$Step-9$: 

**Drop Mutlple Columns**

In [35]:
df.drop(['Age','City'],axis=1,inplace=True)

In [36]:
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$Step-10$: 

**Drop the Rows**

In [37]:
import pandas as pd
names=['Ayush', 'Avinash', 'Akash', 'Anvi']
age=[25, 30, 35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
idx=['A','B','C','D']
cols=['Names','Age','City']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [38]:
df.drop('A',axis=0,inplace=True)

In [39]:
df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

$Step-11$: 

**How to save the data frame**

- Generally data frames are 2 types

- csv (comma separated values)

- excel

In [48]:
df.to_csv('csvFileData.csv') # saving data in csv with index

In [49]:
df.to_csv('csvFileWithoutIndex.csv',index=False) # saving data in csv without index

In [47]:
df.to_excel('excelFileData.xlsx') #  saving data in excel with index

In [44]:
df.to_excel('excelFileWithOutIndex.xlsx',index=False) #  saving data in excel without index